ir_version: 1.1.0
module: training
status: active
source: .dev/TRAINING_CANONICAL_MATRIX.md
decision_scope: full_module

module_identity:
  mission: reduce_coach_operational_time_and_improve_training_decisions
  unit_of_value: better_training_decision_with_less_time_and_more_context
  operational_backbone:
    - need
    - objective
    - prescription
    - session
    - execution
    - response
    - review
    - adjustment
  real_world_operational_value_unit: training_intervention_cycle
  problem_statement: >
    module degrading to session CRUD without purpose, losing value as coach
    operational decision engine and becoming unable to represent the real
    training intervention cycle
  benchmarks:
    - XPS Network
    - Smartabase
    - Teamworks AMS
    - BridgeAthletic
    - TeamBuildr
    - Sportlyzer
    - Handball.ai
  not_this_module:
    - generic_calendar_only
    - ecommerce_style_crud
    - isolated_session_crud
    - ai_autonomous_prescription
    - analytics_decision_override
    - direct_notification_delivery
    - audit_repository
    - permission_definition
  in_scope:
    - training_sessions
    - session_templates
    - exercise_library
    - attendance
    - wellness_form
    - internal_load
    - availability_status
    - athlete_override
    - planned_vs_actual_tracking
    - need_detection
    - objective_management
    - intervention_cycle
    - feedback_management
    - athlete_checkin
    - eligibility_guard
  out_of_scope:
    - billing
    - chat_generalist
    - external_vendor_integration_full
    - advanced_tactical_ontology_without_registry

# ---------------------------------------------------------------------------
# CAPABILITIES
# ---------------------------------------------------------------------------
capabilities:
  - id: training.exercise_library
    unique_governance_id: CAP-TRAINING-001
    name: exercise_library
    description: reusable catalog of exercises and drills
    priority: P1
    phase: core
    decision_refs: [TRAIN-DEC-001]

  - id: training.session_management
    unique_governance_id: CAP-TRAINING-002
    name: session_management
    description: create, manage, publish and complete training sessions
    priority: P1
    phase: core
    decision_refs: [TRAIN-DEC-006, TRAIN-DEC-007, TRAIN-DEC-008]

  - id: training.intervention_cycle_management
    unique_governance_id: CAP-TRAINING-003
    name: intervention_cycle_management
    description: manage the full training intervention cycle from need to adjustment
    priority: P1
    phase: core
    decision_refs: [TRAIN-DEC-002]

  - id: training.need_detection
    unique_governance_id: CAP-TRAINING-004
    name: need_detection
    description: detect and register training needs with traceable origin
    priority: P1
    phase: core
    decision_refs: [TRAIN-DEC-003]

  - id: training.objective_management
    unique_governance_id: CAP-TRAINING-005
    name: objective_management
    description: create and manage session objectives linked to needs or explicit coach rationale
    priority: P1
    phase: core
    decision_refs: [TRAIN-DEC-004]

  - id: training.recommendation_handling
    unique_governance_id: CAP-TRAINING-006
    name: recommendation_handling
    description: receive analytics recommendations and require coach explicit acceptance
    priority: P1
    phase: core
    decision_refs: [TRAIN-DEC-005, TRAIN-DEC-018]

  - id: training.execution_recording
    unique_governance_id: CAP-TRAINING-007
    name: execution_recording
    description: record execution of training sessions with prescription context and planned vs actual
    priority: P1
    phase: core
    decision_refs: [TRAIN-DEC-009, TRAIN-DEC-010]

  - id: training.live_adjustment
    unique_governance_id: CAP-TRAINING-008
    name: live_adjustment
    description: record live session adjustments with structured reason
    priority: P2
    phase: core
    decision_refs: [TRAIN-DEC-011]

  - id: training.feedback_management
    unique_governance_id: CAP-TRAINING-009
    name: feedback_management
    description: contextual feedback threads linked to operational entities with outcome
    priority: P2
    phase: core
    decision_refs: [TRAIN-DEC-013, TRAIN-DEC-014]

  - id: training.cycle_review
    unique_governance_id: CAP-TRAINING-010
    name: cycle_review
    description: review intervention cycles with execution evidence
    priority: P2
    phase: core
    decision_refs: [TRAIN-DEC-015]

  - id: training.eligibility_guard
    unique_governance_id: CAP-TRAINING-011
    name: eligibility_guard
    description: block ineligible athletes from executable prescriptions with audited override
    priority: P1
    phase: core
    decision_refs: [TRAIN-DEC-022]

  - id: training.adaptive_checkin
    unique_governance_id: CAP-TRAINING-012
    name: adaptive_checkin
    description: adaptive friction check-in based on athlete wellness state
    priority: P2
    phase: extended
    decision_refs: [TRAIN-DEC-025]

  - id: training.continuity_management
    unique_governance_id: CAP-TRAINING-013
    name: continuity_management
    description: preserve technical rationale and decisions across staff changes
    priority: P2
    phase: extended
    decision_refs: [TRAIN-DEC-026]

# ---------------------------------------------------------------------------
# ENTITIES
# ---------------------------------------------------------------------------
entities:
  - id: training.training_session
    unique_governance_id: ENT-TRAINING-001
    name: training_session
    kind: ssot
    description: operational unit of training within an intervention cycle
    has_lifecycle: true
    fields:
      - name: id
        unique_governance_id: FLD-TRAINING-001
        semantic_type_ref: core.id.uuid_v4
        required: true
        nullable: false
        description: public identifier
      - name: teamId
        unique_governance_id: FLD-TRAINING-002
        semantic_type_ref: core.team.id
        required: true
        nullable: false
        description: owning team
      - name: scheduledStartAt
        unique_governance_id: FLD-TRAINING-003
        semantic_type_ref: core.time.timestamp_utc
        required: true
        nullable: false
        description: planned session start
      - name: state
        unique_governance_id: FLD-TRAINING-004
        semantic_type_ref: training.state
        required: true
        nullable: false
        enum_ref: training.session_state_enum
        description: lifecycle state
      - name: sessionObjectiveIds
        unique_governance_id: FLD-TRAINING-005
        semantic_type_ref: training.session_objective.id_array
        required: true
        nullable: false
        min_items: 1
        description: objectives that anchor the session (min 1)
      - name: interventionCycleRef
        unique_governance_id: FLD-TRAINING-006
        semantic_type_ref: training.intervention_cycle.id
        required: true
        nullable: false
        description: owning intervention cycle
      - name: responsibleStaffRef
        unique_governance_id: FLD-TRAINING-007
        semantic_type_ref: core.staff.id
        required: false
        nullable: true
        description: responsible staff (required before publish)
      - name: scheduledEndAt
        unique_governance_id: FLD-TRAINING-008
        semantic_type_ref: core.time.timestamp_utc
        required: false
        nullable: true
        description: planned session end (required before publish)
      - name: plannedContentSnapshot
        unique_governance_id: FLD-TRAINING-009
        semantic_type_ref: training.content_snapshot
        required: false
        nullable: true
        immutable_after: PUBLISHED
        description: immutable snapshot of planned content after publication
      - name: createdBy
        unique_governance_id: FLD-TRAINING-010
        semantic_type_ref: core.actor.id
        required: true
        nullable: false
        description: creator actor reference
      - name: createdAt
        unique_governance_id: FLD-TRAINING-011
        semantic_type_ref: core.time.timestamp_utc
        required: true
        nullable: false
        description: creation timestamp
    relations:
      - target_entity_ref: teams.team
        relation_kind: many_to_one
        ownership: source_holds_fk
        delete_policy: restrict
      - target_entity_ref: training.training_intervention_cycle
        relation_kind: many_to_one
        ownership: source_holds_fk
        delete_policy: restrict
    inferable:
      - generic_catalog_metadata
    non_inferable:
      - publication_rules
      - completion_rules
      - state_transitions

  - id: training.training_intervention_cycle
    unique_governance_id: ENT-TRAINING-002
    name: training_intervention_cycle
    kind: ssot
    description: sovereign unit of training intervention — need to adjustment cycle
    has_lifecycle: true
    fields:
      - name: id
        unique_governance_id: FLD-TRAINING-020
        semantic_type_ref: core.id.uuid_v4
        required: true
        nullable: false
        description: public identifier
      - name: teamRef
        unique_governance_id: FLD-TRAINING-021
        semantic_type_ref: core.team.id
        required: true
        nullable: false
        description: owning team
      - name: objectiveRefs
        unique_governance_id: FLD-TRAINING-022
        semantic_type_ref: training.session_objective.id_array
        required: true
        nullable: false
        min_items: 1
        description: objectives driving this cycle (min 1)
      - name: status
        unique_governance_id: FLD-TRAINING-023
        semantic_type_ref: training.intervention_cycle.state
        required: true
        nullable: false
        enum_ref: training.intervention_cycle_state_enum
        description: lifecycle state
      - name: createdBy
        unique_governance_id: FLD-TRAINING-024
        semantic_type_ref: core.actor.id
        required: true
        nullable: false
        description: creator actor reference
      - name: createdAt
        unique_governance_id: FLD-TRAINING-025
        semantic_type_ref: core.time.timestamp_utc
        required: true
        nullable: false
        description: creation timestamp
    relations:
      - target_entity_ref: teams.team
        relation_kind: many_to_one
        ownership: source_holds_fk
        delete_policy: restrict
    non_inferable:
      - cycle_completion_rules
      - objective_linkage_rules

  - id: training.need_detected
    unique_governance_id: ENT-TRAINING-003
    name: need_detected
    kind: ssot
    description: training need with traceable origin evidence
    has_lifecycle: true
    fields:
      - name: id
        unique_governance_id: FLD-TRAINING-030
        semantic_type_ref: core.id.uuid_v4
        required: true
        nullable: false
        description: public identifier
      - name: sourceType
        unique_governance_id: FLD-TRAINING-031
        semantic_type_ref: training.need_source_type
        required: true
        nullable: false
        enum_ref: training.need_source_type_enum
        description: origin category (analytics.signal | scout.signal | match.outcome | wellness.alert | medical.flag | coach.manual_observation)
      - name: description
        unique_governance_id: FLD-TRAINING-032
        semantic_type_ref: core.text.medium
        required: true
        nullable: false
        description: human-readable need description
      - name: evidenceRef
        unique_governance_id: FLD-TRAINING-033
        semantic_type_ref: core.external_ref
        required: false
        nullable: true
        description: reference to source evidence entity in origin module
      - name: manualCoachRationale
        unique_governance_id: FLD-TRAINING-034
        semantic_type_ref: core.text.medium
        required: false
        nullable: true
        description: explicit coach rationale (when no external evidence)
      - name: status
        unique_governance_id: FLD-TRAINING-035
        semantic_type_ref: training.need_detected.state
        required: true
        nullable: false
        enum_ref: training.need_detected_state_enum
        description: lifecycle state (OPEN | LINKED_TO_OBJECTIVE | DISMISSED)
      - name: createdAt
        unique_governance_id: FLD-TRAINING-036
        semantic_type_ref: core.time.timestamp_utc
        required: true
        nullable: false
        description: creation timestamp
    constraints:
      - one_of_required: [evidenceRef, manualCoachRationale]
    non_inferable:
      - evidence_ref_must_point_to_valid_source_entity

  - id: training.session_objective
    unique_governance_id: ENT-TRAINING-004
    name: session_objective
    kind: ssot
    description: training objective linked to a need or explicit coach rationale
    has_lifecycle: false
    fields:
      - name: id
        unique_governance_id: FLD-TRAINING-040
        semantic_type_ref: core.id.uuid_v4
        required: true
        nullable: false
        description: public identifier
      - name: description
        unique_governance_id: FLD-TRAINING-041
        semantic_type_ref: core.text.medium
        required: true
        nullable: false
        description: objective description
      - name: successCriteria
        unique_governance_id: FLD-TRAINING-042
        semantic_type_ref: core.text.medium
        required: true
        nullable: false
        description: success criteria for the objective
      - name: needDetectedRef
        unique_governance_id: FLD-TRAINING-043
        semantic_type_ref: training.need_detected.id
        required: false
        nullable: true
        description: linked need (one of origin refs required)
      - name: competitiveFocusRef
        unique_governance_id: FLD-TRAINING-044
        semantic_type_ref: core.external_ref
        required: false
        nullable: true
        description: competitive focus reference
      - name: developmentGoalRef
        unique_governance_id: FLD-TRAINING-045
        semantic_type_ref: core.external_ref
        required: false
        nullable: true
        description: development goal reference (owned by athletes/development module)
      - name: manualCoachRationale
        unique_governance_id: FLD-TRAINING-046
        semantic_type_ref: core.text.medium
        required: false
        nullable: true
        description: explicit coach rationale (when no external ref)
    constraints:
      - one_of_required:
          [
            needDetectedRef,
            competitiveFocusRef,
            developmentGoalRef,
            manualCoachRationale,
          ]
    non_inferable:
      - origin_linkage_rule

  - id: training.recommendation
    unique_governance_id: ENT-TRAINING-005
    name: recommendation
    kind: reference
    description: analytics-generated recommendation pending coach explicit review
    has_lifecycle: true
    fields:
      - name: id
        unique_governance_id: FLD-TRAINING-050
        semantic_type_ref: core.id.uuid_v4
        required: true
        nullable: false
        description: public identifier
      - name: sourceModule
        unique_governance_id: FLD-TRAINING-051
        semantic_type_ref: core.module_ref
        required: true
        nullable: false
        description: module that generated the recommendation
      - name: evidenceRef
        unique_governance_id: FLD-TRAINING-052
        semantic_type_ref: core.external_ref
        required: true
        nullable: false
        description: evidence backing the recommendation
      - name: signalType
        unique_governance_id: FLD-TRAINING-053
        semantic_type_ref: training.recommendation_signal_type
        required: true
        nullable: false
        description: type of analytics signal
      - name: status
        unique_governance_id: FLD-TRAINING-054
        semantic_type_ref: training.recommendation.state
        required: true
        nullable: false
        enum_ref: training.recommendation_state_enum
        description: lifecycle state (PENDING_COACH_REVIEW | ACCEPTED | DISMISSED)
      - name: decisionRationale
        unique_governance_id: FLD-TRAINING-055
        semantic_type_ref: core.text.medium
        required: false
        nullable: true
        description: coach rationale on accept/dismiss (required on status change)
    non_inferable:
      - coach_must_decide_explicitly
      - no_auto_materialization_into_need

  - id: training.execution_record
    unique_governance_id: ENT-TRAINING-006
    name: execution_record
    kind: ssot
    description: record of what was actually executed in a training session
    has_lifecycle: false
    fields:
      - name: id
        unique_governance_id: FLD-TRAINING-060
        semantic_type_ref: core.id.uuid_v4
        required: true
        nullable: false
        description: public identifier
      - name: trainingSessionRef
        unique_governance_id: FLD-TRAINING-061
        semantic_type_ref: training.training_session.id
        required: true
        nullable: false
        description: owning session (mandatory)
      - name: sessionBlockRef
        unique_governance_id: FLD-TRAINING-062
        semantic_type_ref: training.session_block.id
        required: false
        nullable: true
        description: block context (one of context refs required)
      - name: prescriptionLineRef
        unique_governance_id: FLD-TRAINING-063
        semantic_type_ref: training.prescription_line.id
        required: false
        nullable: true
        description: prescription context
      - name: improvisedRationale
        unique_governance_id: FLD-TRAINING-064
        semantic_type_ref: core.text.medium
        required: false
        nullable: true
        description: rationale for improvised execution (when no block/prescription ref)
      - name: executedBy
        unique_governance_id: FLD-TRAINING-065
        semantic_type_ref: core.actor.id
        required: true
        nullable: false
        description: actor who recorded the execution
      - name: recordedAt
        unique_governance_id: FLD-TRAINING-066
        semantic_type_ref: core.time.timestamp_utc
        required: true
        nullable: false
        description: execution record timestamp
      - name: completionStatus
        unique_governance_id: FLD-TRAINING-067
        semantic_type_ref: training.execution_completion_status
        required: true
        nullable: false
        description: completion status of the execution
      - name: actualLoad
        unique_governance_id: FLD-TRAINING-068
        semantic_type_ref: core.numeric.load_indicator
        required: false
        nullable: true
        description: actual load measured
    constraints:
      - one_of_required:
          [sessionBlockRef, prescriptionLineRef, improvisedRationale]
    non_inferable:
      - session_must_be_published_or_in_progress

  - id: training.session_adjustment
    unique_governance_id: ENT-TRAINING-007
    name: session_adjustment
    kind: ssot
    description: structured live adjustment to a training session with required reason
    has_lifecycle: false
    fields:
      - name: id
        unique_governance_id: FLD-TRAINING-070
        semantic_type_ref: core.id.uuid_v4
        required: true
        nullable: false
        description: public identifier
      - name: trainingSessionRef
        unique_governance_id: FLD-TRAINING-071
        semantic_type_ref: training.training_session.id
        required: true
        nullable: false
        description: adjusted session
      - name: adjustmentType
        unique_governance_id: FLD-TRAINING-072
        semantic_type_ref: training.adjustment_type
        required: true
        nullable: false
        enum_ref: training.adjustment_type_enum
        description: type of adjustment (enum, open decision OD-TRAINING-003)
      - name: originalValue
        unique_governance_id: FLD-TRAINING-073
        semantic_type_ref: core.text.medium
        required: true
        nullable: false
        description: original value before adjustment
      - name: newValue
        unique_governance_id: FLD-TRAINING-074
        semantic_type_ref: core.text.medium
        required: true
        nullable: false
        description: new value after adjustment
      - name: reasonCode
        unique_governance_id: FLD-TRAINING-075
        semantic_type_ref: training.adjustment_reason_code
        required: true
        nullable: false
        enum_ref: training.adjustment_reason_code_enum
        description: structured reason code (enum, open decision OD-TRAINING-003)
      - name: reasonText
        unique_governance_id: FLD-TRAINING-076
        semantic_type_ref: core.text.medium
        required: true
        nullable: false
        description: human-readable reason
      - name: adjustedBy
        unique_governance_id: FLD-TRAINING-077
        semantic_type_ref: core.actor.id
        required: true
        nullable: false
        description: actor who made the adjustment
      - name: adjustedAt
        unique_governance_id: FLD-TRAINING-078
        semantic_type_ref: core.time.timestamp_utc
        required: true
        nullable: false
        description: adjustment timestamp
    non_inferable:
      - session_must_be_in_progress_or_published

  - id: training.feedback_thread
    unique_governance_id: ENT-TRAINING-008
    name: feedback_thread
    kind: ssot
    description: contextual technical feedback thread anchored to an operational entity
    has_lifecycle: true
    fields:
      - name: id
        unique_governance_id: FLD-TRAINING-080
        semantic_type_ref: core.id.uuid_v4
        required: true
        nullable: false
        description: public identifier
      - name: targetAthleteRef
        unique_governance_id: FLD-TRAINING-081
        semantic_type_ref: core.athlete.id
        required: true
        nullable: false
        description: athlete target of the feedback
      - name: createdBy
        unique_governance_id: FLD-TRAINING-082
        semantic_type_ref: core.actor.id
        required: true
        nullable: false
        description: creator actor
      - name: content
        unique_governance_id: FLD-TRAINING-083
        semantic_type_ref: core.text.long
        required: true
        nullable: false
        description: feedback content
      - name: trainingSessionRef
        unique_governance_id: FLD-TRAINING-084
        semantic_type_ref: training.training_session.id
        required: false
        nullable: true
        description: anchor — session reference (one of anchors required)
      - name: sessionBlockRef
        unique_governance_id: FLD-TRAINING-085
        semantic_type_ref: training.session_block.id
        required: false
        nullable: true
        description: anchor — block reference
      - name: sessionObjectiveRef
        unique_governance_id: FLD-TRAINING-086
        semantic_type_ref: training.session_objective.id
        required: false
        nullable: true
        description: anchor — objective reference
      - name: evidenceRef
        unique_governance_id: FLD-TRAINING-087
        semantic_type_ref: core.external_ref
        required: false
        nullable: true
        description: anchor — evidence reference
      - name: status
        unique_governance_id: FLD-TRAINING-088
        semantic_type_ref: training.feedback_thread.state
        required: true
        nullable: false
        enum_ref: training.feedback_thread_state_enum
        description: lifecycle state (OPEN | CLOSED)
      - name: conversationOutcome
        unique_governance_id: FLD-TRAINING-089
        semantic_type_ref: training.conversation_outcome
        required: false
        nullable: true
        enum_ref: training.conversation_outcome_enum
        description: outcome on close (reflection|commitment|pending_action|followup|decision) — required when closing
    constraints:
      - one_of_required:
          [
            trainingSessionRef,
            sessionBlockRef,
            sessionObjectiveRef,
            evidenceRef,
          ]
      - required_on_close: [conversationOutcome]
    non_inferable:
      - anchor_must_belong_to_target_athlete_scope

  - id: training.session_block
    unique_governance_id: ENT-TRAINING-009
    name: session_block
    kind: ssot
    description: structured block within a training session containing prescriptions
    has_lifecycle: false
    fields:
      - name: id
        unique_governance_id: FLD-TRAINING-090
        semantic_type_ref: core.id.uuid_v4
        required: true
        nullable: false
        description: public identifier
      - name: trainingSessionRef
        unique_governance_id: FLD-TRAINING-091
        semantic_type_ref: training.training_session.id
        required: true
        nullable: false
        description: owning session
      - name: blockOrder
        unique_governance_id: FLD-TRAINING-092
        semantic_type_ref: core.numeric.position
        required: true
        nullable: false
        description: order of block within session
    non_inferable:
      - block_content_schema

  - id: training.attention_queue_item
    unique_governance_id: ENT-TRAINING-010
    name: attention_queue_item
    kind: ssot
    description: prioritized attention item in coach queue with severity and reason
    has_lifecycle: true
    fields:
      - name: id
        unique_governance_id: FLD-TRAINING-100
        semantic_type_ref: core.id.uuid_v4
        required: true
        nullable: false
        description: public identifier
      - name: severityLevel
        unique_governance_id: FLD-TRAINING-101
        semantic_type_ref: training.severity_level
        required: true
        nullable: false
        enum_ref: training.severity_level_enum
        description: severity (critical | high | medium | low)
      - name: reasonCode
        unique_governance_id: FLD-TRAINING-102
        semantic_type_ref: training.attention_reason_code
        required: true
        nullable: false
        description: structured reason code
      - name: targetEntityRef
        unique_governance_id: FLD-TRAINING-103
        semantic_type_ref: core.entity_ref
        required: true
        nullable: false
        description: entity that triggered the attention item
      - name: createdAt
        unique_governance_id: FLD-TRAINING-104
        semantic_type_ref: core.time.timestamp_utc
        required: true
        nullable: false
        description: creation timestamp
      - name: resolved
        unique_governance_id: FLD-TRAINING-105
        semantic_type_ref: core.boolean
        required: true
        nullable: false
        description: whether item is resolved

  - id: training.derived_signal
    unique_governance_id: ENT-TRAINING-011
    name: derived_signal
    kind: derived
    description: computed signal derived from immutable raw data — must not replace raw facts
    has_lifecycle: false
    fields:
      - name: id
        unique_governance_id: FLD-TRAINING-110
        semantic_type_ref: core.id.uuid_v4
        required: true
        nullable: false
        description: public identifier
      - name: rawDataRef
        unique_governance_id: FLD-TRAINING-111
        semantic_type_ref: core.entity_ref
        required: true
        nullable: false
        immutable: true
        description: reference to immutable raw data source
      - name: computedAt
        unique_governance_id: FLD-TRAINING-112
        semantic_type_ref: core.time.timestamp_utc
        required: true
        nullable: false
        description: computation timestamp
      - name: algorithmVersion
        unique_governance_id: FLD-TRAINING-113
        semantic_type_ref: core.version.semver
        required: true
        nullable: false
        description: version of algorithm used for traceability
    non_inferable:
      - derived_must_not_replace_raw

  - id: training.continuity_snapshot
    unique_governance_id: ENT-TRAINING-012
    name: continuity_snapshot
    kind: ssot
    description: technical rationale snapshot for staff continuity — must not be deleted on role change
    has_lifecycle: false
    fields:
      - name: id
        unique_governance_id: FLD-TRAINING-120
        semantic_type_ref: core.id.uuid_v4
        required: true
        nullable: false
        description: public identifier
      - name: sessionRef
        unique_governance_id: FLD-TRAINING-121
        semantic_type_ref: training.training_session.id
        required: false
        nullable: true
        description: referenced session (one of session/cycle ref required)
      - name: cycleRef
        unique_governance_id: FLD-TRAINING-122
        semantic_type_ref: training.intervention_cycle.id
        required: false
        nullable: true
        description: referenced intervention cycle
      - name: keyDecisions
        unique_governance_id: FLD-TRAINING-123
        semantic_type_ref: core.text.long
        required: true
        nullable: false
        description: key decisions made during the period
      - name: openItems
        unique_governance_id: FLD-TRAINING-124
        semantic_type_ref: core.text.long
        required: true
        nullable: false
        description: open items for incoming staff
      - name: createdBy
        unique_governance_id: FLD-TRAINING-125
        semantic_type_ref: core.actor.id
        required: true
        nullable: false
        description: creator actor
      - name: createdAt
        unique_governance_id: FLD-TRAINING-126
        semantic_type_ref: core.time.timestamp_utc
        required: true
        nullable: false
        description: creation timestamp
    constraints:
      - one_of_required: [sessionRef, cycleRef]

# ---------------------------------------------------------------------------
# RELATIONS
# ---------------------------------------------------------------------------
relations:
  - source_entity_ref: training.training_session
    target_entity_ref: teams.team
    relation_kind: many_to_one
    ownership: source_holds_fk
    delete_policy: restrict
    required: true

  - source_entity_ref: training.training_session
    target_entity_ref: training.training_intervention_cycle
    relation_kind: many_to_one
    ownership: source_holds_fk
    delete_policy: restrict
    required: true

  - source_entity_ref: training.training_intervention_cycle
    target_entity_ref: teams.team
    relation_kind: many_to_one
    ownership: source_holds_fk
    delete_policy: restrict
    required: true

  - source_entity_ref: training.need_detected
    target_entity_ref: training.training_intervention_cycle
    relation_kind: many_to_one
    ownership: source_holds_fk
    delete_policy: restrict
    required: false

  - source_entity_ref: training.session_objective
    target_entity_ref: training.need_detected
    relation_kind: many_to_one
    ownership: source_holds_fk
    delete_policy: restrict
    required: false

  - source_entity_ref: training.execution_record
    target_entity_ref: training.training_session
    relation_kind: many_to_one
    ownership: source_holds_fk
    delete_policy: restrict
    required: true

  - source_entity_ref: training.session_adjustment
    target_entity_ref: training.training_session
    relation_kind: many_to_one
    ownership: source_holds_fk
    delete_policy: restrict
    required: true

  - source_entity_ref: training.feedback_thread
    target_entity_ref: training.training_session
    relation_kind: many_to_one
    ownership: source_holds_fk
    delete_policy: restrict
    required: false

  - source_entity_ref: training.session_block
    target_entity_ref: training.training_session
    relation_kind: many_to_one
    ownership: source_holds_fk
    delete_policy: restrict
    required: true

# ---------------------------------------------------------------------------
# STATE MODELS
# ---------------------------------------------------------------------------
state_models:
  - entity_ref: training.training_session
    unique_governance_id: STM-TRAINING-001
    states:
      - DRAFT
      - PLANNED
      - SCHEDULED
      - IN_PROGRESS
      - COMPLETED
      - CANCELLED
      - ARCHIVED
    initial_state: DRAFT
    allowed_transitions:
      - from: DRAFT
        to: PLANNED
      - from: DRAFT
        to: SCHEDULED
      - from: PLANNED
        to: SCHEDULED
      - from: SCHEDULED
        to: IN_PROGRESS
      - from: IN_PROGRESS
        to: COMPLETED
      - from: DRAFT
        to: CANCELLED
      - from: PLANNED
        to: CANCELLED
      - from: SCHEDULED
        to: CANCELLED
      - from: IN_PROGRESS
        to: CANCELLED
      - from: COMPLETED
        to: ARCHIVED
    forbidden_transitions:
      - from: DRAFT
        to: COMPLETED
      - from: DRAFT
        to: IN_PROGRESS
      - from: COMPLETED
        to: DRAFT
      - from: CANCELLED
        to: DRAFT
      - from: CANCELLED
        to: PLANNED
      - from: CANCELLED
        to: SCHEDULED
      - from: ARCHIVED
        to: any
    transition_guards:
      - transition: PLANNED->SCHEDULED
        rule_ref: training.rule.publication_preconditions_met
      - transition: DRAFT->SCHEDULED
        rule_ref: training.rule.publication_preconditions_met
      - transition: IN_PROGRESS->COMPLETED
        rule_ref: training.rule.completion_evidence_required

  - entity_ref: training.training_intervention_cycle
    unique_governance_id: STM-TRAINING-002
    states:
      - OPEN
      - IN_PROGRESS
      - REVIEW
      - ADJUSTED
      - COMPLETED
      - ARCHIVED
    initial_state: OPEN
    allowed_transitions:
      - from: OPEN
        to: IN_PROGRESS
      - from: IN_PROGRESS
        to: REVIEW
      - from: REVIEW
        to: ADJUSTED
      - from: REVIEW
        to: COMPLETED
      - from: ADJUSTED
        to: COMPLETED
      - from: COMPLETED
        to: ARCHIVED
    forbidden_transitions: []
    transition_guards:
      - transition: IN_PROGRESS->REVIEW
        rule_ref: training.rule.cycle_review_requires_evidence

  - entity_ref: training.need_detected
    unique_governance_id: STM-TRAINING-003
    states:
      - OPEN
      - LINKED_TO_OBJECTIVE
      - DISMISSED
    initial_state: OPEN
    allowed_transitions:
      - from: OPEN
        to: LINKED_TO_OBJECTIVE
      - from: OPEN
        to: DISMISSED
    forbidden_transitions:
      - from: DISMISSED
        to: OPEN
      - from: LINKED_TO_OBJECTIVE
        to: DISMISSED
    transition_guards: []

  - entity_ref: training.recommendation
    unique_governance_id: STM-TRAINING-004
    states:
      - PENDING_COACH_REVIEW
      - ACCEPTED
      - DISMISSED
    initial_state: PENDING_COACH_REVIEW
    allowed_transitions:
      - from: PENDING_COACH_REVIEW
        to: ACCEPTED
      - from: PENDING_COACH_REVIEW
        to: DISMISSED
    forbidden_transitions:
      - from: ACCEPTED
        to: DISMISSED
      - from: DISMISSED
        to: ACCEPTED
    transition_guards:
      - transition: PENDING_COACH_REVIEW->ACCEPTED
        rule_ref: training.rule.coach_explicit_decision_required
      - transition: PENDING_COACH_REVIEW->DISMISSED
        rule_ref: training.rule.coach_explicit_decision_required

  - entity_ref: training.feedback_thread
    unique_governance_id: STM-TRAINING-005
    states:
      - OPEN
      - CLOSED
    initial_state: OPEN
    allowed_transitions:
      - from: OPEN
        to: CLOSED
    forbidden_transitions:
      - from: CLOSED
        to: OPEN
    transition_guards:
      - transition: OPEN->CLOSED
        rule_ref: training.rule.feedback_closure_requires_outcome

  - entity_ref: training.attention_queue_item
    unique_governance_id: STM-TRAINING-006
    states:
      - OPEN
      - RESOLVED
    initial_state: OPEN
    allowed_transitions:
      - from: OPEN
        to: RESOLVED
    forbidden_transitions: []
    transition_guards: []

# ---------------------------------------------------------------------------
# RULES  (INV-TRAIN-* → RUL-TRAINING-*)
# ---------------------------------------------------------------------------
rules:
  - id: training.rule.session_requires_objective
    unique_governance_id: RUL-TRAINING-001
    type: invariant
    inv_ref: INV-TRAIN-001
    subject_ref: training.training_session
    statement: every training_session must reference at least one valid session_objective
    formal_check_hint: sessionObjectiveIds min_items=1 enforced at creation and publish; returns 422 when absent
    blocking: true

  - id: training.rule.objective_requires_traceable_origin
    unique_governance_id: RUL-TRAINING-002
    type: invariant
    inv_ref: INV-TRAIN-002
    subject_ref: training.session_objective
    statement: every session_objective must have at least one of (needDetectedRef | competitiveFocusRef | developmentGoalRef | manualCoachRationale)
    formal_check_hint: one_of constraint enforced at creation; returns 422 when all are null
    blocking: true

  - id: training.rule.need_does_not_auto_create_session
    unique_governance_id: RUL-TRAINING-003
    type: boundary
    inv_ref: INV-TRAIN-003
    subject_ref: training.need_detected
    statement: need_detected must not automatically trigger session creation without explicit coach action
    formal_check_hint: no API path allows need_detected to create training_session directly
    blocking: true

  - id: training.rule.ai_only_recommends_coach_decides
    unique_governance_id: RUL-TRAINING-004
    type: boundary
    inv_ref: INV-TRAIN-004
    subject_ref: training.recommendation
    statement: AI and analytics can only generate recommendations; coach must explicitly accept or dismiss before any training action
    formal_check_hint: recommendation.status must transition via PENDING_COACH_REVIEW with explicit coach actor
    blocking: true

  - id: training.rule.publication_preconditions_met
    unique_governance_id: RUL-TRAINING-005
    type: lifecycle
    inv_ref: INV-TRAIN-005
    subject_ref: training.training_session
    statement: >
      session cannot publish without minimum trainable content:
      sessionObjectiveIds (min 1), team_scope or athlete_scope_refs (min 1),
      responsibleStaffRef, scheduledEndAt, session_blocks (min 1)
    formal_check_hint: POST /training-sessions/{id}/publish returns 422 when any minimum field absent
    blocking: true
    precondition_refs:
      - sessionObjectiveIds min_items=1
      - responsibleStaffRef non-null
      - scheduledEndAt non-null
      - session_blocks min_items=1

  - id: training.rule.execution_requires_prescription_context
    unique_governance_id: RUL-TRAINING-006
    type: invariant
    inv_ref: INV-TRAIN-006
    subject_ref: training.execution_record
    statement: every execution_record must reference a training_session and at least one of (sessionBlockRef | prescriptionLineRef | improvisedRationale)
    formal_check_hint: one_of constraint enforced; POST /training-sessions/{id}/execution returns 422 without context
    blocking: true

  - id: training.rule.planned_actual_must_not_merge
    unique_governance_id: RUL-TRAINING-007
    type: invariant
    inv_ref: INV-TRAIN-007
    subject_ref: training.training_session
    statement: planned fields must never be overwritten by actual fields; plannedContentSnapshot is immutable after PUBLISHED
    formal_check_hint: distinct planned_* and actual_* field groups; plannedContentSnapshot immutability test returns 409 on mutation
    blocking: true

  - id: training.rule.adjustment_requires_structured_reason
    unique_governance_id: RUL-TRAINING-008
    type: invariant
    inv_ref: INV-TRAIN-008
    subject_ref: training.session_adjustment
    statement: every session_adjustment must have adjustmentType, reasonCode and reasonText
    formal_check_hint: POST /training-sessions/{id}/adjustments returns 422 without reasonCode
    blocking: true

  - id: training.rule.completion_evidence_required
    unique_governance_id: RUL-TRAINING-009
    type: lifecycle
    inv_ref: INV-TRAIN-009
    subject_ref: training.training_session
    statement: session cannot transition to COMPLETED without at least one of (attendance_record | post_session_note | athlete_rpe | coach_session_note | execution_record)
    formal_check_hint: POST /training-sessions/{id}/complete returns 422 without minimum evidence
    blocking: true

  - id: training.rule.feedback_requires_anchor
    unique_governance_id: RUL-TRAINING-010
    type: invariant
    inv_ref: INV-TRAIN-010
    subject_ref: training.feedback_thread
    statement: feedback_thread must be anchored to at least one of (trainingSessionRef | sessionBlockRef | sessionObjectiveRef | evidenceRef)
    formal_check_hint: POST /training-sessions/{id}/feedback returns 422 without anchor_ref
    blocking: true

  - id: training.rule.cycle_review_requires_evidence
    unique_governance_id: RUL-TRAINING-011
    type: audit
    inv_ref: INV-TRAIN-011
    subject_ref: training.training_intervention_cycle
    statement: review_outcome must reference at least one execution_record or equivalent evidence
    formal_check_hint: review_outcome with evidence_ref present and valid
    blocking: false

  - id: training.rule.restriction_profile_read_only_in_training
    unique_governance_id: RUL-TRAINING-014
    type: boundary
    inv_ref: INV-TRAIN-014
    subject_ref: training.training_session
    statement: restriction_profile is owned by medical module; training can only read, never write or create
    formal_check_hint: no POST/PATCH/DELETE for restriction_profile in training module paths
    blocking: true

  - id: training.rule.analytics_cannot_mutate_training_state
    unique_governance_id: RUL-TRAINING-015
    type: boundary
    inv_ref: INV-TRAIN-015
    subject_ref: training.training_session
    statement: analytics module cannot directly alter any sovereign state in training module
    formal_check_hint: no API endpoint in training accepts analytics as mutating actor
    blocking: true

  - id: training.rule.status_lifecycle_closed
    unique_governance_id: RUL-TRAINING-017
    type: lifecycle
    inv_ref: INV-TRAIN-017
    subject_ref: training.training_session
    statement: training_session status transitions are closed; no arbitrary state mutation is allowed
    formal_check_hint: state machine tests with forbidden transitions returning 422
    blocking: true

  - id: training.rule.completed_immutable_no_destructive_edit
    unique_governance_id: RUL-TRAINING-020
    type: audit
    inv_ref: INV-TRAIN-020
    subject_ref: training.training_session
    statement: COMPLETED sessions are immutable by destructive edit; corrections require audit_correction_record with original_snapshot
    formal_check_hint: PATCH on COMPLETED session fields returns 409; correction requires elevated authorization
    blocking: true

  - id: training.rule.ineligible_athlete_blocked
    unique_governance_id: RUL-TRAINING-021
    type: authorization
    inv_ref: INV-TRAIN-021
    subject_ref: training.training_session
    statement: athlete with active restriction_profile must be blocked from executable prescriptions without audited override
    formal_check_hint: prescription for restricted athlete returns 422 without override; override generates audit_event
    blocking: true

  - id: training.rule.attention_queue_requires_severity_and_reason
    unique_governance_id: RUL-TRAINING-027
    type: integrity
    inv_ref: INV-TRAIN-027
    subject_ref: training.attention_queue_item
    statement: every attention_queue_item must have severityLevel, reasonCode and targetEntityRef
    formal_check_hint: creation validation enforces all three fields; alert without reason_code rejected
    blocking: false

  - id: training.rule.feedback_closure_requires_outcome
    unique_governance_id: RUL-TRAINING-028
    type: invariant
    inv_ref: INV-TRAIN-028
    subject_ref: training.feedback_thread
    statement: feedback_thread cannot close without a conversationOutcome enum value
    formal_check_hint: PATCH /feedback-threads/{id}/close returns 422 without conversationOutcome
    blocking: true

  - id: training.rule.relevant_decisions_audited
    unique_governance_id: RUL-TRAINING-029
    type: audit
    inv_ref: INV-TRAIN-029
    subject_ref: training.training_session
    statement: all relevant training actions (publish, adjust, cancel, complete, override, correction) must generate audit_event
    formal_check_hint: audit_event generated with required fields for each relevant action; no audit gap
    blocking: true

  - id: training.rule.rationale_survives_staff_change
    unique_governance_id: RUL-TRAINING-030
    type: audit
    inv_ref: INV-TRAIN-030
    subject_ref: training.continuity_snapshot
    statement: decision_rationale and continuity_snapshot must not be deleted on staff role change
    formal_check_hint: non-deletion test of decision_rationale on staff_handoff event
    blocking: false

  - id: training.rule.derived_signals_do_not_replace_raw_facts
    unique_governance_id: RUL-TRAINING-036
    type: integrity
    inv_ref: INV-TRAIN-036
    subject_ref: training.derived_signal
    statement: derived_signal must reference raw_data via rawDataRef (immutable); derived must not overwrite raw
    formal_check_hint: rawDataRef present and non-null; raw_data immutability test after creation
    blocking: true

  - id: training.rule.notifications_via_intents_only
    unique_governance_id: RUL-TRAINING-039
    type: boundary
    inv_ref: INV-TRAIN-039
    subject_ref: training.training_session
    statement: training module must never directly deliver notifications; only emit notification_intent events
    formal_check_hint: no direct push/sms/email paths in training OpenAPI spec
    blocking: true

  - id: training.rule.audit_via_transversal_module
    unique_governance_id: RUL-TRAINING-040
    type: audit
    inv_ref: INV-TRAIN-040
    subject_ref: training.training_session
    statement: training module must not maintain internal audit log; all audit via structured events to audit module
    formal_check_hint: no internal audit storage in training paths; audit_event emitted for each relevant action
    blocking: true

  - id: training.rule.identity_access_governs_permissions
    unique_governance_id: RUL-TRAINING-041
    type: authorization
    inv_ref: INV-TRAIN-041
    subject_ref: training.training_session
    statement: training module must not define permissions independently; all permission checks reference identity_access
    formal_check_hint: no hardcoded permission in training paths; all checks via identity_access reference
    blocking: true

  - id: training.rule.coach_explicit_decision_required
    unique_governance_id: RUL-TRAINING-004B
    type: authorization
    subject_ref: training.recommendation
    statement: recommendation cannot transition from PENDING_COACH_REVIEW without explicit coach actor action
    formal_check_hint: no automated state change from PENDING_COACH_REVIEW; requires actor with coach role
    blocking: true

# ---------------------------------------------------------------------------
# API USE CASES
# ---------------------------------------------------------------------------
api_use_cases:
  - id: training.session.create
    unique_governance_id: API-TRAINING-001
    resource_ref: training_session
    operation: create
    purpose: create draft training session with at least one session objective
    request_entity_refs:
      - training.training_session
      - training.session_objective
    response_entity_refs:
      - training.training_session
    requires_state_model: true
    decision_refs: [TRAIN-DEC-006]
    forbidden_inference:
      - auto_publish_on_create
      - session_without_objective

  - id: training.session.publish
    unique_governance_id: API-TRAINING-002
    resource_ref: training_session
    operation: publish
    purpose: publish session with minimum trainable content guard
    request_entity_refs:
      - training.training_session
    response_entity_refs:
      - training.training_session
    requires_state_model: true
    decision_refs: [TRAIN-DEC-007]
    forbidden_inference:
      - auto_publish_without_content_guard

  - id: training.session.change_state
    unique_governance_id: API-TRAINING-003
    resource_ref: training_session
    operation: state_transition
    purpose: transition session state (start, complete, cancel, archive) via valid transitions only
    request_entity_refs:
      - training.training_session
    response_entity_refs:
      - training.training_session
    requires_state_model: true
    decision_refs: [TRAIN-DEC-008]
    forbidden_inference:
      - arbitrary_state_mutation

  - id: training.execution.record
    unique_governance_id: API-TRAINING-004
    resource_ref: execution_record
    operation: create
    purpose: record what was actually executed in a session with prescription context
    request_entity_refs:
      - training.execution_record
    response_entity_refs:
      - training.execution_record
    requires_state_model: true
    decision_refs: [TRAIN-DEC-009]
    forbidden_inference:
      - execution_without_session_context

  - id: training.session.complete
    unique_governance_id: API-TRAINING-005
    resource_ref: training_session
    operation: complete
    purpose: mark session COMPLETED with minimum response evidence guard
    request_entity_refs:
      - training.training_session
    response_entity_refs:
      - training.training_session
    requires_state_model: true
    decision_refs: [TRAIN-DEC-012]
    forbidden_inference:
      - complete_without_evidence

  - id: training.adjustment.create
    unique_governance_id: API-TRAINING-006
    resource_ref: session_adjustment
    operation: create
    purpose: record structured live adjustment during session execution
    request_entity_refs:
      - training.session_adjustment
    response_entity_refs:
      - training.session_adjustment
    requires_state_model: false
    decision_refs: [TRAIN-DEC-011]
    forbidden_inference:
